---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
source: html/4bc3e328-f2ab-c189-d806-78c650ec6eac.htm
---
# VertexStreamPositionNormalColored Methods

Inserts a VertexStreamPositionNormalColored into the stream and associated buffer.